wosayttn/M55M1BSP/_CUnit/eqei/main.c
/******************************************************************************
* @file    main.c
* @version V1.00
* @brief   CUnit test main function
*
* SPDX-License-Identifier: Apache-2.0
* @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

// Library header file
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "CUnit.h"
#include "Console.h"
#include "NuMicro.h"
#include "eqei_cunit.h"

// Internal funcfion definition
void AddTests(void);

void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Enable clock */
    CLK_EnableXtalRC(CLK_SRCCTL_HXTEN_Msk);
    CLK_EnableXtalRC(CLK_SRCCTL_HIRCEN_Msk);

    /* Waiting for clock ready */
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

    /* Enable SYS clock */
    CLK_SetBusClock(CLK_SCLKSEL_SCLKSEL_APLL0, FREQ_180MHZ);

    /* Enable UART module clock */
    CLK_EnableModuleClock(EQEI0_MODULE);
    CLK_EnableModuleClock(EQEI1_MODULE);
    CLK_EnableModuleClock(EQEI2_MODULE);
    CLK_EnableModuleClock(EQEI3_MODULE);

    CLK_EnableModuleClock(GPIOA_MODULE);
    CLK_EnableModuleClock(GPIOB_MODULE);
    CLK_EnableModuleClock(GPIOC_MODULE);
    CLK_EnableModuleClock(GPIOD_MODULE);
    CLK_EnableModuleClock(GPIOE_MODULE);
    CLK_EnableModuleClock(GPIOF_MODULE);

    SYS_ResetModule(SYS_EQEI0RST);
    SYS_ResetModule(SYS_EQEI1RST);
    SYS_ResetModule(SYS_EQEI2RST);
    SYS_ResetModule(SYS_EQEI3RST);

    /* Enable UART module clock */
    SetDebugUartCLK();

    SystemCoreClockUpdate();
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set PD multi-function pins for UART0 RXD(PB.12) and TXD(PB.13) */
    SetDebugUartMFP();

}

void exit(int32_t code)
{
    if (code)
        while (1)
            ; // Fail
    else
        while (1)
            ; // Success
}

void Enable_SelfTest(void)
{
    SYS_UnlockReg();
    /* Enable global self test mode */
    outp32(0x40000E00, inp32(0x40000E00) | 1);
    //SYS->ALTCTL0 |= BIT0;

    GPIO_SetMode(PA, BIT4, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT3, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT5, GPIO_MODE_OUTPUT);
    PA4 = PA3 = PA5 = 0;

    GPIO_SetMode(PA, BIT9, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT8, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT10, GPIO_MODE_OUTPUT);
    PA9 = PA8 = PA10 = 0;

    GPIO_SetMode(PD, BIT0, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PD, BIT13, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PD, BIT1, GPIO_MODE_OUTPUT);
    PD0 = PD13 = PD1 = 0;

    GPIO_SetMode(PA, BIT1, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT0, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PA, BIT2, GPIO_MODE_OUTPUT);
    PA1 = PA0 = PA2 = 0;
}

void Disable_SelfTest(void)
{
    SYS_UnlockReg();
    /* Enable global self test mode */
    outp32(0x40000E00, inp32(0x40000E00) & ~1);
    //SYS->ALTCTL0 &= ~(BIT0);
}

int main(int argc, char *argv[])
{

    /* Unlock protected registers for ISP function */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Init DEBUG_PORT to 115200-8N1 for printf */
    InitDebugUart();

    printf("\n\nCPU @ %dHz\n", SystemCoreClock);

    if (CU_initialize_registry())
    {
        fprintf(stderr, " Initialization of Test Registry failed. ");
        exit(EXIT_FAILURE);
    }
    else
    {
        AddTests();
        CU_console_run_tests();
        CU_cleanup_registry();
    }

    while (SYS->PDID)
        ;
}

void AddTests(void)
{
    assert(NULL != CU_get_registry());
    assert(!CU_is_test_running());

    if (CUE_SUCCESS != CU_register_suites(suites))
    {
        fprintf(stderr, "Register suites failed - %s ", CU_get_error_msg());
        exit(EXIT_FAILURE);
    }
}
